Repository: proskurinandrey/RSAEncrypting_LR1_Lukoyanov
Catalog: RSAEncrypting_LR1_Lukoyanov/Strings.*.resx
Languages: ru

# ProgramName
source: RSA Text Encrypting/Decrypting Util (demonstration)
ru: Программа RSA-шифрования текста (демонстрация)

# ProgramDescription
source: Util can encrypt and decrypt text only in ASCII encoding (UTF-8/UTF-16 support coming soon)
ru: Программа шифрует и дешифрует текст (допускаются только символы русского и английского алфавита, а также арабские цифры. Весь текст будет приведен к нижнему регистру. Поддержка UTF-8/UTF-16 появится в ближайшее время)

# ChoosePrimes
source: Choose two prime numbers to use RSA algorithm:
ru: Выберите два простых числа для работы RSA-алгоритма (через пробел):

# IncorrectInput
source: Input is incorrect. Try again or enter 'q' to exit
ru: Неверный ввод! Попробуйте снова или введите 'q', чтобы выйти из программы

# FirstNumberIsntPrime
source: First number isn't prime! Try again
ru: Первое число не является простым! Попробуйте снова

# SecondNumberIsntPrime
source: Second number isn't prime! Try again
ru: Второе число не является простым! Попробуйте снова

# AvailableOptions
source: Choose the option: 1. Encrypt and decrypt entered text 2. Encrypt and decrypt text file Type 'q' to exit
ru: Выберите функцию: 1. Зашифровать и расшифровать текст в консоли 2. Зашифровать и расшивровать текстовый файл Введите 'q', чтобы выйти из программы

# EnterOptionNumber
source: Enter the option number:
ru: Введите номер функции:

# IncorrectOption
source: Incorrect option number. Try again
ru: Неверный номер функции! Попробуйте снова

# TextToEncryptDecrypt
source: Enter text to encrypt/decrypt:
ru: Введите текст, который необходимо зашифровать/расшифровать:

# EmptyInput
source: Input is empty
ru: Введенный текст не содержит символов!

# PublicKey
source: Public key: {0}
ru: Открытый ключ: {0}

# EncryptingProcess
source: Encrypting...
ru: Шифрование...

# EncryptionTime
source: Encryption time: {0}
ru: Продолжительность шифрования: {0}

# EncryptedBytes
source: Encrypted bytes: {0}
ru: Зашифрованные байты: {0}

# PrivateKey
source: Private key: {0}
ru: Закрытый ключ: {0}

# DecryptingProcess
source: Decrypting...
ru: Расшифровка...

# DecryptionTime
source: Decryption time: {0}
ru: Продолжительность расшифровки: {0}

# DecryptedText
source: Decrypted text: {0}
ru: Расшифрованный текст: {0}

# TotalTime
source: Total time passed: {0}
ru: Всего потрачено времени: {0}

# FilePath
source: Enter file path:
ru: Введите путь к файлу:

# InvalidFilePath
source: File path is invalid or file doesn't exist
ru: Путь некорректен или файл не существует!

# NoContentToEncrypt
source: File contains no content to encrypt
ru: Файл не содержит данных для шифрования

# EncryptionFilePath
source: Encrypted file saved at {0}
ru: Зашифрованные данные сохранены в файл {0}

# DecryptionFilePath
source: Decrypted file saved at {0}
ru: Расшифрованные данные сохранены в файл {0}
